_posts/mac/2017-07-27-brew.html
---
layout: post
title: "Homebrew"
date: 2017-07-27
categories: MacOS
tags:
    - MacOS
    - Homebrew
---

<div id="outline-container-org112ebc4" class="outline-2">
<h2 id="org112ebc4">brew 命令简述</h2>
<div class="outline-text-2" id="text-org112ebc4">
<ul class="org-ul">
<li><code>brew</code> 主要用来下载一些不带界面的命令行下的工具和第三方库来进行二次开发</li>
<li><code>brew cask</code> 主要用来下载一些带界面的应用软件，下载好后会自动安装，并能在 mac 中直接运行使用</li>
<li><code>brew install curl</code> 可以安装 curl 第三方库，这样你在开发时就可以使用它的库来进行开发</li>
<li><code>brew cask install chrome</code> 可以安装谷歌浏览器应用程序，可直接运行</li>
<li><code>brew</code> 偏管理第三方库和命令行工具方面的东东</li>
<li><code>brew cask</code> 可以看作是苹果官方 app store 的补充，是一个众多贡献者们维护的非苹果官方软件商店，你也可以在这里下 mac 软件用</li>
<li><code>brew tap</code> 没有参数会自动更新已经存在的 tap 并列出当前已经 tapped 的仓库</li>
</ul>
</div>
</div>

<div id="outline-container-orgec778e3" class="outline-2">
<h2 id="orgec778e3">安装 brew</h2>
<div class="outline-text-2" id="text-orgec778e3">
<p>
我们可以用 brew 命令来更新 OSX 系统，brew 命令类似于 RHEL 的 yum 和 ubuntu 的 apt-get 命令，OSX 没有自带 brew，登陆 Homebrew 网站，找到 ruby 代码来安装 brew：
</p>

<div class="org-src-container">
<pre class="src src-shell">ruby -e <span style="color: #2d9574;">"$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d23465" class="outline-2">
<h2 id="org7d23465">更新 brew</h2>
<div class="outline-text-2" id="text-org7d23465">
<p>
要获取最新的包的列表，首先得更新 Homebrew 自己。这可以用 <code>brew update</code> 办到。
</p>

<div class="org-src-container">
<pre class="src src-shell">brew update
</pre>
</div>
</div>
</div>

<div id="outline-container-org288a96c" class="outline-2">
<h2 id="org288a96c">更新包</h2>
<div class="outline-text-2" id="text-org288a96c">
<p>
要获取最新的包的列表，首先得更新 Homebrew 自己。这可以用 <code>brew update</code> 办到。
</p>

<div class="org-src-container">
<pre class="src src-shell">brew outdated
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb3c231b" class="outline-2">
<h2 id="orgb3c231b">更新需要更新的包</h2>
<div class="outline-text-2" id="text-orgb3c231b">
<div class="org-src-container">
<pre class="src src-shell">brew upgrade             <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26356;&#26032;&#25152;&#26377;&#30340;&#21253;</span>
brew upgrade package     <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26356;&#26032;&#25351;&#23450;&#30340;&#21253;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org167e0ae" class="outline-2">
<h2 id="org167e0ae">清理旧版本</h2>
<div class="outline-text-2" id="text-org167e0ae">
<p>
一般情况下，新版本安装了，旧版本就不需要了。我会用 <code>brew cleanup</code> 清理旧版本和缓存文件。Homebrew 只会清除比当前安装的包更老的版本，所以不用担心有些包没更新但被删了。
</p>

<div class="org-src-container">
<pre class="src src-shell">brew cleanup             <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#28165;&#29702;&#25152;&#26377;&#21253;&#30340;&#26087;&#29256;&#26412;</span>
brew cleanup package     <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#28165;&#29702;&#25351;&#23450;&#21253;&#30340;&#26087;&#29256;&#26412;</span>
brew cleanup -n          <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26597;&#30475;&#21487;&#28165;&#29702;&#30340;&#26087;&#29256;&#26412;&#21253;&#65292;&#19981;&#25191;&#34892;&#23454;&#38469;&#25805;&#20316;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org49ed22e" class="outline-2">
<h2 id="org49ed22e">锁定不想更新的包</h2>
<div class="outline-text-2" id="text-org49ed22e">
<p>
如果经常更新的话， <code>brew update</code> 一次更新所有的包是非常方便的。但我们有时候会担心自动升级把一些不希望更新的包更新了。数据库就属于这一类，尤其是 PostgreSQL 跨 minor 版本升级都要迁移数据库的。我们更希望找个时间单独处理它。这时可用 <code>brew pin</code> 去锁定这个包，然后 <code>brew update</code> 就会略过它了。
</p>

<div class="org-src-container">
<pre class="src src-shell">brew pin package       <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#38145;&#23450;&#26576;&#20010;&#21253;</span>
brew unpin package     <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21462;&#28040;&#38145;&#23450;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3bc13d3" class="outline-2">
<h2 id="org3bc13d3">其他几个常用命令</h2>
<div class="outline-text-2" id="text-org3bc13d3">
<p>
<code>brew info</code> 可以查看包的相关信息，最有用的应该是包依赖和相应的命令。比如 Nginx 会提醒你怎么加 launchctl，PostgreSQL 会告诉你如何迁移数据库。这些信息会在包安装完成后自动显示，如果忘了的话可以用这个命令很方便地查看。
</p>

<div class="org-src-container">
<pre class="src src-shell">brew info package     <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26174;&#31034;&#26576;&#20010;&#21253;&#30340;&#20449;&#24687;</span>
brew info             <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26174;&#31034;&#23433;&#35013;&#20102;&#21253;&#25968;&#37327;&#65292;&#25991;&#20214;&#25968;&#37327;&#65292;&#21644;&#24635;&#21344;&#29992;&#31354;&#38388;</span>

brew deps <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21487;&#20197;&#26174;&#31034;&#21253;&#30340;&#20381;&#36182;&#20851;&#31995;&#65292;&#25105;&#24120;&#29992;&#23427;&#26469;&#26597;&#30475;&#24050;&#23433;&#35013;&#30340;&#21253;&#30340;&#20381;&#36182;&#65292;&#28982;&#21518;&#21028;&#26029;&#21738;&#20123;&#21253;&#26159;&#21487;&#20197;&#23433;&#20840;&#21024;&#38500;&#30340;&#12290;</span>
brew deps --installed --tree <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26597;&#30475;&#24050;&#23433;&#35013;&#30340;&#21253;&#30340;&#20381;&#36182;&#65292;&#26641;&#24418;&#26174;&#31034;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org57e786d" class="outline-2">
<h2 id="org57e786d">修改 brew 国内源</h2>
<div class="outline-text-2" id="text-org57e786d">
<p>
因为 Homebrew 默认的源是 GitHub 源，在国内因为你懂的原因，下载速度堪忧，顾考虑更换国内源，幸好中科大和清华都提供了 brew 源，因此我们考虑更换为这两个学校的 brew 源
</p>
</div>

<div id="outline-container-org8bb9eb5" class="outline-3">
<h3 id="org8bb9eb5">步骤</h3>
<div class="outline-text-3" id="text-org8bb9eb5">
<p>
替换 brew.git
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7;">cd</span> <span style="color: #2d9574;">"$(brew --repo)"</span>
git remote set-url origin https://mirrors.ustc.edu.cn/brew.git
</pre>
</div>

<p>
替换 homebrew-core.git
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7;">cd</span> <span style="color: #2d9574;">"$(brew --repo)/Library/Taps/homebrew/homebrew-core"</span>
git remote set-url origin https://mirrors.ustc.edu.cn/homebrew-core.git
</pre>
</div>
</div>
</div>

<div id="outline-container-org794348f" class="outline-3">
<h3 id="org794348f">替换 Homebrew Bottles 源</h3>
<div class="outline-text-3" id="text-org794348f">
<p>
对于 bash 用户
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">'export HOMEBREW_BOTTLE_DOMAIN=https://mirrors.ustc.edu.cn/homebrew-bottles'</span> &gt;&gt; ~/.bash_profile
<span style="color: #4f97d7;">source</span> ~/.bash_profile
</pre>
</div>

<p>
对于 zsh 用户
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">'export HOMEBREW_BOTTLE_DOMAIN=https://mirrors.ustc.edu.cn/homebrew-bottles'</span> &gt;&gt; ~/.zshrc
<span style="color: #4f97d7;">source</span> ~/.zshrc
</pre>
</div>
</div>
</div>

<div id="outline-container-orge5693a7" class="outline-3">
<h3 id="orge5693a7">切换回官方源</h3>
<div class="outline-text-3" id="text-orge5693a7">
<p>
重置 brew.git
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7;">cd</span> <span style="color: #2d9574;">"$(brew --repo)"</span>
git remote set-url origin https://github.com/Homebrew/brew.git
</pre>
</div>

<p>
重置 homebrew-core.git
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7;">cd</span> <span style="color: #2d9574;">"$(brew --repo)/Library/Taps/homebrew/homebrew-core"</span>
git remote set-url origin https://github.com/Homebrew/homebrew-core.git
</pre>
</div>

<p>
注释掉 bash 配置文件里的有关 Homebrew Bottles 即可恢复官方源。重启 bash 或让 bash 重读配置文件。
</p>
</div>
</div>
</div>

<div id="outline-container-orgc8db2c4" class="outline-2">
<h2 id="orgc8db2c4">Homebrew Cask 更换国内源</h2>
<div class="outline-text-2" id="text-orgc8db2c4">
</div>
<div id="outline-container-orgf73bc17" class="outline-3">
<h3 id="orgf73bc17">替换为 USTC 镜像：</h3>
<div class="outline-text-3" id="text-orgf73bc17">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7;">cd</span> <span style="color: #2d9574;">"$(brew --repo)"</span>/Library/Taps/homebrew/homebrew-cask
git remote set-url origin https://mirrors.ustc.edu.cn/homebrew-cask.git
</pre>
</div>
</div>
</div>

<div id="outline-container-org9bbb9f8" class="outline-3">
<h3 id="org9bbb9f8">重置为官方地址：</h3>
<div class="outline-text-3" id="text-org9bbb9f8">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7;">cd</span> <span style="color: #2d9574;">"$(brew --repo)"</span>/Library/Taps/homebrew/homebrew-cask
git remote set-url origin https://github.com/Homebrew/homebrew-cask
</pre>
</div>

<p>
注：Caskroom 的 Git 地址在 2018 年 5 月 25 日从 <a href="https://github.com/caskroom/homebrew-cask">https://github.com/caskroom/homebrew-cask</a> 迁移到了 <a href="https://github.com/Homebrew/homebrew-cask">https://github.com/Homebrew/homebrew-cask</a> 。
</p>
</div>
</div>
</div>

<div id="outline-container-org3a929d2" class="outline-2">
<h2 id="org3a929d2">使用指定本地安装包</h2>
<div class="outline-text-2" id="text-org3a929d2">
<ul class="org-ul">
<li>执行 <code>brew cask doctor</code> 命令，查看缓存目录位置。</li>
<li>执行 <code>brew cask install xxx</code> 命令。</li>
<li>若不满意 <code>brew</code> 的下载速度，中断下载，查看缓存目录，会发现里面有 <code>xxx.incomplete</code> 文件。</li>
<li>将通过其他方式获得安装包重命名为去除 <code>.incomplete</code> 后缀的文件名，删除缓存文件后将安装包拷贝到缓存目录。</li>
<li>重新运行 <code>brew cask install xxx</code> 。</li>
</ul>
</div>
</div>
